Tekla Open API Reference for Tekla Structures 2025
BoltName Properties
The BoltName type exposes the following members.
Properties
Name | Description
Name
 The bolt item name.
Top
See Also
Reference
BoltName Class
Tekla.Structures.Catalogs Namespace